In [3]:
import pandas as pd
import numpy as np

In [6]:
data_dic = {'Name':['sohail','danyal','hamza',np.nan], 'Age': [27,28,22,12]}

In [7]:
data = pd.DataFrame(data_dic)

In [8]:
print(data)

     Name  Age
0  sohail   27
1  danyal   28
2   hamza   22
3     NaN   12

In [9]:
data.head()

     Name  Age
0  sohail   27
1  danyal   28
2   hamza   22
3     NaN   12

In [10]:
# we are filling gaps
data['Name'] = data['Name'].fillna('Anonymous')

In [11]:
data.head()

        Name  Age
0     sohail   27
1     danyal   28
2      hamza   22
3  Anonymous   12

In [12]:
data['Name'] = data['Name'].fillna('Anonymous')

In [13]:
data.head()

        Name  Age
0     sohail   27
1     danyal   28
2      hamza   22
3  Anonymous   12

In [14]:
# to add new data
new_row = { 'Name': 'Zaman', 'Age': 50}

In [16]:
data = data.append(new_row, ignore_index=True)

C:\Users\Danya\AppData\Local\Temp\ipykernel_9800\1468281316.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  data = data.append(new_row, ignore_index=True)

In [17]:
data.head()

        Name  Age
0     sohail   27
1     danyal   28
2      hamza   22
3  Anonymous   12
4      Zaman   50

In [18]:
data['Address'] = 'Pakistan'

In [19]:
data.head()

        Name  Age   Address
0     sohail   27  Pakistan
1     danyal   28  Pakistan
2      hamza   22  Pakistan
3  Anonymous   12  Pakistan
4      Zaman   50  Pakistan

In [22]:
data['Name'].value_counts()

sohail       1
danyal       1
hamza        1
Anonymous    1
Zaman        1
Name: Name, dtype: int64